[
  {
    "path": "posts/2020-12-31-painted-turtles/",
    "title": "Painted Turtles",
    "description": "An application of the Hotelling T2 test where the measurements of the carapaces of painted turtles are compared across sex. Shows a visualization of the utility that accounting for several variables under one technique can have.",
    "author": [
      {
        "name": "Gavin Gordon",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2020-12-31",
    "categories": [
      "Hotelling T2",
      "Independent Samples"
    ],
    "contents": "\r\n\r\n\r\n\r\nProblem (Question 6.18)\r\nThis problem is taken from Johnson 1992. Measurements on the carapaces from a study of painted turtles are given. The aim is to determine whether or not there are differences across the sex.\r\n\r\n\r\n\r\n\r\npreserve7fd854467ed9446a\r\n\r\nMost of the analysis will be done on the Logarithm scale.\r\nA Visualization of the Problem\r\nUnivariate Plots\r\nThe first three graphs will look at the problem from a univariate perspective. The particular graph that was chosen (beanplot) to represent the information allows for comment on the distribution features so this will be done at the same time.\r\n\r\n\r\n\r\nFigure 1: Distributions of Length over Sex\r\n\r\n\r\n\r\nWe can see that Females have one major and one minor mode with the presence of a potential outlier that is roughly 180. The Males seem to have one mode, with a distribution that is eerily symmetric. The grand average of the data is 124 with the median for the Females as well as most of it’s data points falling above this value with the opposite occurring for the Males.\r\nThe reason why there seems to be a minor mode should be inspected as perhaps there is a subgroup present within the dataset that should be accounted for. Given the information thus far it would not be surprising to know that the univariate welch t-test reports a difference in the two sexes over the feature of length. Most of the overlap between the two distributions seem to happen with the 75% quantile of the males and the lower 25% quantile of the females.\r\n\r\n\r\n\r\nFigure 2: Distributions of Width over Sex\r\n\r\n\r\n\r\nWe can see that the densities both have a single mode. There seems to be a similar sort of overlap between the sample points as with the feature length. It is the case that the univariate welch t test reports a difference in width between the two sexes. There is a potential outlier in the male distribution but overall there isn’t any alarming feature.\r\n\r\n\r\n\r\nFigure 3: Distributions of Height over Sex\r\n\r\n\r\n\r\nMost of what was already discussed applies to describing the above plot. Both are considered to have single modes. Even though there is somewhat of a distortion in the upper percentiles for the female, there are not enough data points developing that mode to indicate a potential subgroup; this is probability better explained by a higher level of variation in the population.\r\nBivariate Plots\r\nNow we will try to see what value adding another variable can bring to the analysis.\r\n\r\npreservedc741f492633d56b\r\n\r\nWe are concerned about the overlap between the distributions for the univariate plots. In some cases the variation may be enough to cloud any difference that may actually exist. Ideally the addition of another variable, in this case Width to the plot of length gives another dimension to essentially sort the data and allows us to compute the mean in a more accurate manner. From the above plot this does not seem to be the case; the overlap in the upper and lower percentiles as mentioned before, are now visualized better.\r\n\r\npreservef5fa00dd395e159f\r\n\r\nThe plot of length against height brings us closer to what we hope to achieve. In the lower ranges, from the univariate perspective those points are intertwined with each other; however the addition of the Height feature to length has highlighted the difference in the two sexes as there is now some distance between the colored points. This is not perfect but it will make the estimates more accurate.\r\n\r\npreservefe006403a586357b\r\n\r\nA similar case to the previous plot is observed where there is some separation when Height is combined with Width. It would seem that the Height variable adds valuable discriminatory power to the analysis.\r\n\r\npreserve1b46ae4ed36dc53a\r\n\r\nFinally we examine the 3D plot of the dependent variables. This requires you to interact with the graph presented. If you were to move the chart such that you were looking down with the length and width features in the typically x and y plane then you would replicate the first chart where the separation power is not ideal. Now you should rotate the chart such that the height feature comes into focus, as you rotate it then you might notice how the feature lifts some of the green points (females) out of the cloud of blue points (males). Although you can ask for this “lifting effect” to be greater, nevertheless it speaks to the limitations of univariate cases and what can be accomplished by accounting for more variables in the same analysis technique.\r\nAssumptions\r\nIndependence of Observations\r\nThe observations are taken from different turtles.\r\nNormality and Outliers\r\nThe sample sizes within the Group Sex would be enough to be considered a large sample thus the Central Limit theorem would take effect to assure normality of the sample mean. Also, the previous plots show that there are likely no point that severely disturb the overall trend that is displayed within Sex across the combination of variables.\r\nEquality of Variance\r\n\r\n\r\nBox’s M-test for Homogeneity of Covariance Matrices\r\nTest statistic\r\ndf\r\nP value\r\n12.89\r\n6\r\n0.04482 *\r\n\r\n\r\nThe test shows that the variables do not have the same variance across the groups. Although this assumption was aided by the use of the logarithm transformation, the overall problem was not reduced to satisfactory level.\r\nSince we do not have equality of variances, we now consider a similar technique that does not require this assumption. It falls into the same problem category as the Welch’s t test known as the Behrens–Fisher type problems.\r\n \r\nAnalysis\r\n\r\n\r\nTwo-sample Test for Multivariate Means\r\nTest statistic\r\nP value\r\nAlternative hypothesis\r\n85.052\r\n9.2e-10 * * *\r\ntrue means are different.\r\n\r\n\r\n \r\nThis analysis uses the technique established in Krishnamoorthy 2004.\r\nThe p value attempts to quantify how often we may come across such a dataset given that the null hypothesis is true. If we were to assume that there is no difference between the Sex across the variables of Length, Width and Height then the data that was collected would be considered to be an extremely rare event. Therefore, this should serve as evidence that there is a difference between the Sexes along one or more of the variables considered until some other explanation arises that may state otherwise.\r\n \r\nConfidence Intervals for each Variable\r\nThe original question asked for the calculation of both simultaneous and bonferroni intervals. Since we are not assuming equality of variances, I am unsure as to whether simultaneous confidence intervals can be constructed. Thus only the bonferroni intervals are constructed.\r\n\r\n\r\nBonferonni Confidence Intervals for Features\r\nVariable\r\nEstimate\r\nLower\r\nUpper\r\nLength\r\n-22.67\r\n-23.66\r\n-21.67\r\nWidth\r\n-14.29\r\n-14.9\r\n-13.68\r\nHeight\r\n-11.33\r\n-11.69\r\n-10.97\r\n\r\n\r\n \r\n \r\nReferences\r\nJohnson, R. A., & Wichern, D. W. (1992). Applied multivariate statistical analysis. Englewood Cliffs, N.J: Prentice Hall\r\nKrishnamoorthy, K., & Yu, J. (2004). Modified Nel and Van der Merwe test for the multivariate Behrens–Fisher problem. Statistics & probability letters, 66(2), 161-169.\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-12-31-painted-turtles/painted-turtles_files/figure-html5/unnamed-chunk-4-1.png",
    "last_modified": "2021-01-05T15:40:54-04:00",
    "input_file": "painted-turtles.utf8.md",
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/2020-12-30-profile-analysis/",
    "title": "Profile Analysis",
    "description": "Introduction to profile analysis. The example problem details the comparison between husband and wife pairs for the same questions about how they feel to each other.",
    "author": [
      {
        "name": "Gavin Gordon",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2020-12-30",
    "categories": [
      "Profile Analysis"
    ],
    "contents": "\r\nWhat is Profile Analysis?\r\nThis is used to compare a collection of variable means between groups or individuals. The design can take the form of a repeated measures design by having the variable(s) be measured over time/space (or other applicable feature); or the design may involve different variables measured at one instance which would be compared across the groups/individuals simultaneously.\r\nThis comparison is done by answering three questions sequentially. First the question of whether the profiles are parallel to each other; second whether the means when grouped by variables have the same magnitude; third whether there is a magnitude that holds for all variables across groups. The first two questions concern whether the profiles are the same while the third concerns the behavior of the profiles after establishing they are the same.\r\nIf a test fails along the sequence the rest are not completed; the similarity of the profiles is judged based on the number of tests where the null hypothesis is considered to be a reasonable possibility.\r\nProblem Statement (Question 6.27)\r\nThis question is taken from johnson(1992); the package profileR also comes with data on this question.\r\nAs part of a study on love and marriage, a sample of husbands and wifes were asked to respond to these questions:\r\nWhat is the level of passionate love you feel for your partner?\r\nWhat is the level of passionate love your partner feels for you?\r\nWhat is the level of compassionate love that you feel for your partner?\r\nWhat is the level of compassionate love that your partner feels for you?\r\nThe responses were recorded on a five point scale.\r\n\r\n\r\n\r\n\r\n\r\n\r\nAnalysis\r\nI am unsure of the distribution assumptions that must be met. The technique in this case uses ordinal variables. It speaks of satisfying normality due to the central limit theorem. For this case what are the proper summary statistics to show; going by what the technique uses it should be the mean, which of course must be accompanied by a standard deviation. Yet does that make sense in on ordinal setting.\r\nBelow shows a plot of the variable means between the spouses.The plot indicates (at the cross between the first and second variable) that the assumption of parallel profiles may be unlikely.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\npreserve57beac4a049ef3f3\r\n\r\nThe First Test for Parallel behavior\r\n\r\nHo: Profiles are parallel:\r\nMultivariate.Test\r\nStatistic\r\nApprox.F\r\nnum.df\r\nden.df\r\np.value\r\nWilks\r\n0.8786\r\n2.58\r\n3\r\n56\r\n0.06256\r\nPillai\r\n0.1214\r\n2.58\r\n3\r\n56\r\n0.06256\r\nHotelling-Lawley\r\n0.1382\r\n2.58\r\n3\r\n56\r\n0.06256\r\nRoy\r\n0.1382\r\n2.58\r\n3\r\n56\r\n0.06256\r\n\r\n\r\nA value of 0.06 for the p values indicates that, assuming the profiles are in fact parallel then it would highly unlikely for this particular data to be observed from the population. This would serve as evidence that the profiles are likely to not be parallel.\r\nGiven the outcome the remaining two tests are not carried out. Although there is some similarity that occurs for variables two to four, with this variable profile we will not conclude that Husbands and wives feel about each other in the same way.\r\nReferences\r\nJohnson, R. A., & Wichern, D. W. (1992). Applied multivariate statistical analysis. Englewood Cliffs, N.J: Prentice Hall\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2020-12-31T14:21:24-04:00",
    "input_file": "profile-analysis.utf8.md"
  },
  {
    "path": "posts/2020-12-29-testing-new-anesthetics/",
    "title": "Testing New Anesthetics",
    "description": "Will work on this later",
    "author": [
      {
        "name": "Gavin Gordon",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2020-12-29",
    "categories": [],
    "contents": "\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2020-12-30T06:24:06-04:00",
    "input_file": "testing-new-anesthetics.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Multivariate Analysis",
    "description": "This section contains questions that use various multivariate techniques. Each problem explores the assumptions required to use the technique, performs exploratory analysis where possible and in some cases comment on the experimental design when it is available. In cases where the technique is not found to be appropriate the aim will be to suggest alternatives.",
    "author": [
      {
        "name": "Gavin Gordon",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2020-12-16",
    "categories": [],
    "contents": "\r\nPlanned features:\r\nDashboards\r\nNot sure about shiny apps.\r\nSection for monte carlo\r\nSection for designs of experiments\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2020-12-20T05:47:02-04:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2020-12-16-water-quality/",
    "title": "Waste Water Treatment",
    "description": "Waste water samples are divided into paired units and sent to separate laboratories for testing of the Biochemical Oxygen Demand and the amount of Suspended Solids. This is done to make sure that the measurements which guide the activities of the treatment plant are accurate and consistent. The Hotelling T2 test is used to make the comparison across the two dependent variables with the State/Commercial laboratory serving as the grouping variable.",
    "author": [
      {
        "name": "Gavin Gordon",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2020-12-16",
    "categories": [
      "Hotelling T2",
      "One sample",
      "Paired Units"
    ],
    "contents": "\r\n\r\n\r\n\r\n\r\n\r\n\r\nProblem\r\nMunicipal waste water treatment plants are required by law to monitor their discharges into rivers and streams on a regular basis. Concern about the reliability of data from one of these self-monitoring programs led to a study in which samples of effluent were divided and sent to two laboratories for testing. One-half of each sample was sent to the Wisconsin State Laboratory of Hygiene, and one-half was sent to a private commercial laboratory routinely used in the monitoring program. Measurements of biochemical oxygen demand (BOD) and suspended solids (SS) were obtained, for n = 11 sample splits, from the two laboratories.\r\nThis problem will be approached using the paired Hotelling T2 test.\r\nNote: This problem was taken from Johnson 1992, example 6.1. I have added the exploration of assumptions in the replication of the results.\r\n       \r\n\r\npreserveb5d423bac77c5c2a\r\n\r\n       \r\nCheck for Assumptions\r\nOutliers and Group level Normality\r\n\r\n\r\n\r\nFigure 1: Normal Distribution plots for BOD\r\n\r\n\r\n\r\nThe histogram for the BOD differences is skewed with most of the data falling in the negative number range (median equals -14 as well). The points seem to oscillate about the QQ, PP and cumulative distribution plots but seem to hug the lines; this is not ideal but can occur especially with small sample sizes. The plot behaviors show promising approximations to normality. There does not seem to be any alarming data points for consideration as outliers.\r\n       \r\n\r\n\r\n\r\nFigure 2: Normal Distribution plots for SS\r\n\r\n\r\n\r\nThe SS variable does not follow a normal distribution. There are two data points which have differences that are quite alarming relative to the other data points. This is most clearly shown in the histogram where these two values occur above the value of 40. It is likely that these two points will distort the normality assumption; also they present the idea that there may be a subgroup within the dataset that needs to be taken into account. None of the distribution curves seem to match well with the data.\r\n       \r\n\r\n\r\npreserve2a06a05089cbf98e\r\n\r\n\r\nThe bivariate normal distribution seems to be bimodal which adds more evidence to the idea that there may be a subgroup present within the data. Overall the normality assumption is not to a satisfactory level when all of the data is included.\r\n       \r\nOutlier Removal\r\n\r\n\r\n\r\nFigure 3: Normal Distribution plots for SS with outliers removed\r\n\r\n\r\n\r\nWhen the two outliers are removed, the BOD variable shows even more acceptable behavior with respect to normality.\r\n       \r\n\r\n\r\n\r\nFigure 4: Distribution Plots for Commerical Lab BOD Variable\r\n\r\n\r\n\r\nWith the removal of the two outliers another problem surfaces with the SS variable. It would seem that there is another grouping of the data points such that four are positive while five are negative. It is unlikely that any meaningful information can be derived with respect to this variable; an investigation targeting this variable should be undertaken. The bivariate contour plot seems to have lost it’s interpretability for this data.\r\n       \r\nSub-populations within the vector means: Details on the methodology of the experiment were not given to affirm the randomization of the experimental units when being sent to the commercial/state laboratory although this can be assumed given the nature/sensitivity of the problem. There are no other variables available to conduct subgroup analysis to confirm/reject the idea that there are other factors that contribute to the outcome of the experiment. There does seem to be evidence that indicates a sub-population is present thus this assumption is considered to be violated.\r\nIndependence of the paired experimental units: the problem description suggests that samples were taken and then each was split to produce the pair. We will assume that the samples were taken independently of each other with the dependence being formed by the split.\r\nIf this technique were to used under these conditions the results should be taken with caution; there should be an investigation into the bimodal nature of the distribution. The analysis will proceed for illustrative purposes.\r\n       \r\nData Analysis\r\n\r\n\r\n\r\nTable 1: Hotelling Output\r\n\r\n\r\nT2 Stat\r\n\r\n\r\nF value\r\n\r\n\r\nP value\r\n\r\n\r\n13.64\r\n\r\n\r\n6.14\r\n\r\n\r\n0.02\r\n\r\n\r\nTable 1: Confidence Intervals\r\n\r\n\r\nVariable\r\n\r\n\r\nLower\r\n\r\n\r\nUpper\r\n\r\n\r\nBOD\r\n\r\n\r\n-22.45\r\n\r\n\r\n3.73\r\n\r\n\r\nSS\r\n\r\n\r\n-5.70\r\n\r\n\r\n32.25\r\n\r\n\r\n\r\nSo as you might have noticed we have a rather peculiar situation. The test statistic p value would suggest that the means of BOD and SS are significantly different from zero. However the confidence intervals include zero which usually indicate that, since zero is a possibility then you may not assume a difference. The explanation given states that the confidence intervals are constructed around a value which is represented as a linear combination of the differences in BOD and SS; for all of the possible linear combinations only two result in intervals that contain zero being the (1,0) and (0,1) pairs. All other linear combinations do not contain zero.\r\nThe interpretation that will be adopted is that there seems to be a difference in the results from the two labs given that most of the data from the BOD variable is highly skewed in one direction that is below the zero margin.\r\n \r\n \r\n \r\nReferences\r\nJohnson, R. A., & Wichern, D. W. (1992). Applied multivariate statistical analysis. Englewood Cliffs, N.J: Prentice Hall\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-12-16-water-quality/water-quality_files/figure-html5/unnamed-chunk-4-1.png",
    "last_modified": "2020-12-16T17:09:32-04:00",
    "input_file": "water-quality.utf8.md"
  },
  {
    "path": "posts/2020-12-16-lizards-cnemidophorus-vs-sceloporus/",
    "title": "Lizards: Cnemidophorus vs Sceloporus",
    "description": "This was supposed to be a moment where the necessity of performing Multivariate analysis was showcased over the Univariate analysis. Mass and Snout-Vent measurements were taken from the above mentioned lizard generas, and these were compared. Looking at the univariate tests for group differences we would not be able to see any difference while strictly applying the Hotelling T2 test we would have found a difference. However while the checking the assumptions of the Hotelling test, questions were raised.",
    "author": [
      {
        "name": "Gavin Gordon",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2020-12-16",
    "categories": [
      "Hotelling T2",
      "Independent Samples"
    ],
    "contents": "\r\n\r\n\r\n\r\n\r\n\r\n\r\nProblem\r\nA zoologist collected lizards in the southwestern United States. Among other variables, he measured mass (in grams) and the snout-vent length (in millimeters). Because the tails sometimes break off in the wild, the snout-vent length is a more representative measure of length. The data for the lizards from two genera, Cnemidophorus (C) and Sceloporus (S) was collected in 1997 and 1999.\r\nThis activity is aimed to replicate the findings for example 6.71 to show that there is difference in the mass and snout-vent means for the genera of the two lizards using the Hotelling T2 multivariate test for independent samples. I included the testing of the analysis assumptions as well as a bit of exploratory analysis. When the univariate cases are explored for differences the result is that there is none thus the example was used to highlight the need for inspection using multivariate tests.\r\n \r\n \r\n \r\n\r\npreserve440f2dfbdd10f411\r\n\r\n \r\n \r\n \r\nAssumptions\r\nNormality and Outliers\r\n\r\n\r\n\r\nFigure 1: Normal Distribution plots of SVL for Type C\r\n\r\n\r\n\r\nIt should be noted that the lines in the above plots indicate the normal distribution features that would be assumed if the data were treated as though it had come from such a distribution. The points and histogram are what we use to check if the assumed distribution is a good fit. The mass for the type C lizard is not normally distributed. The histogram is highly skewed with what seems to have two peaks. The points around each of the distribution curves do not hug the line in any satisfactory or consistent manner.\r\n \r\n \r\n \r\n\r\n\r\n\r\nFigure 2: Normal Distribution plots of SVL for Type C\r\n\r\n\r\n\r\nThe normality of the SVL variable for the type C lizards are also not satisfactory as these display similar features to the mass variable.\r\n \r\n \r\n \r\n\r\n\r\n\r\npreservecd180cfb310d58b4\r\n\r\n\r\n\r\n\r\npreservefcaa5379070f7c32\r\n\r\n\r\n\r\nThe above show the marginal density plots without any form of distribution imposed onto the data. We can see that in each variable which seems to correlate highly with each other, has two modes. This will be problematic as we are using techniques that accomodate only one mode. It may be that this problem is resolved once the bivariate density is taken into account but unfortunately in this case it is not so.\r\n \r\n \r\n \r\n\r\n\r\npreserveca5c87ff2cb11972\r\n\r\n\r\nIt is evident that we are not be working with a unimodal distribution. This will be an issue since only one mean vector is used as the measure of central tendency within the groups. This would explain the distortion that is found within the normality plots for the type C lizard. This indicates that there may be another variable that needs to be taken into consideration for the analysis or another method that accomodates multiple modes must be used.\r\n \r\n \r\n\r\n\r\ntypecnorm <- data %>% filter(type == \"C\") %>% select(!type) %>% mvnTest(B = 2000)\r\ntypecnorm$mv.test[2]\r\n\r\n\r\np-value \r\n  0.117 \r\n\r\n \r\n  The above is a test for multivariate normal distributions. So I interpret these tests for normality with more caution now. We have the result which is considerately higher than the usual cut off value of 0.05 so one might have been somewhat comfortable with the normality assumption being met. However we can see that this does not mean that it’s the type of normal distribution that is suitable for the technique as distributions which have more than one peak can certainly still count as being normally distributed.  \r\n \r\n \r\n\r\n\r\n\r\nFigure 3: Normal Distribution plots of Mass for Type S\r\n\r\n\r\n\r\nFor a sample size this large the central limit theorem would be applied for the normality assumption. However I still find it useful to make the plots when checking for subgroup indicators. In this case the normality assumption is well satisfied.\r\n \r\n \r\n \r\n\r\n\r\n\r\nFigure 4: Normal Distribution plots of Snout Length for Type S\r\n\r\n\r\n\r\nFor the most part the normality assumption is satisfied but there does seem to be an indicator of a small subgroup; the histogram seems to have a small peak occuring in the right tail. This is better seen with the density plot.\r\n \r\n \r\n \r\n\r\n\r\n\r\npreservee7a082683e7e3d58\r\n\r\n\r\n\r\n\r\npreserve0fce4fa60f7f20eb\r\n\r\n\r\n\r\nThe above plots are again with no imposed distribution on the data. We can see that there is a global peak so these two variables for the type S lizards are appropriate for a unimodal analysis. There is the instance of the minor peak in the tail; this can be explored but may not change the analysis by much.\r\n \r\n \r\n \r\n\r\n\r\npreserve43a61ac37a159539\r\n\r\n\r\nThe bivariate density plot for type S lizards seems to be to a satisfactory level. The range for the peak is somewhat flat as seen in the marginal density curve for the mass variable but a mean vector should still be able to capture the information quite well. Though this makes me wonder about the interpretation of the values of confidence intervals in the frequentist vs the bayesian paradigms. Since only one value within the frequentist world is correct compared to being given probabilities for a range in the bayesian world; one might think the bayesian interpretation to be more suited here as there are quite a few values that may compete for the mean of the distribution for type S lizards.\r\n \r\n \r\n \r\n\r\n\r\ntypesnorm <- data %>% filter(type == \"S\") %>% select(!type) %>% mvnTest(B = 2000)\r\ntypesnorm$mv.test[2]\r\n\r\n\r\np-value \r\n 0.1435 \r\n\r\nWe saw that the univariate and bivariate plots show appealing behaviors and while the type S lizards do satisfy the test for multivariate normality it seems that there may be quite a bit of deformation happening such that the p value isn’t higher. This raises my curiosity with respect to what degree can we inspect a surface.\r\n\r\npreservee8d0b7851b538968\r\n\r\nAlthough the data for snout-vent length approaches normality better there still remains the issue of the bimodal nature of the C group distribution.\r\n \r\n \r\n \r\n\r\npreserve59056bccc9810ae6\r\n\r\nThe bivariate plot shows a strong linear correlation between mass and snout-vent length within the two types of lizards that appear to be different from each other. You may not be able to infer this judging from the mean and standard deviation from the descriptive summary tables (as in the case in the book). Most of the points are within the confidence region ellipses except for a few points that show minor deviation from the overall trend.  \r\n \r\n\r\n\r\n\r\n\r\nmass\r\n\r\n\r\nsvl\r\n\r\n\r\nmass\r\n\r\n\r\n0.35\r\n\r\n\r\n0.09\r\n\r\n\r\nsvl\r\n\r\n\r\n0.09\r\n\r\n\r\n0.03\r\n\r\n\r\n\r\n\r\nmass\r\n\r\n\r\nsvl\r\n\r\n\r\nmass\r\n\r\n\r\n0.51\r\n\r\n\r\n0.15\r\n\r\n\r\nsvl\r\n\r\n\r\n0.15\r\n\r\n\r\n0.04\r\n\r\nTable 1: Test for Equality of Variance\r\nTestName\r\nStatistic\r\nDegreesFreedom\r\nPval\r\nBoxM\r\n3.02\r\n3\r\n0.39\r\n\r\nThe test for equality of the Covariance matrices show that the variances are the same across the two groups of lizards.  \r\n \r\nThe multivariate test for appropriate skewness and kurtosis shows that the values are within tolerable ranges.  \r\n \r\nFinally I consider outliers; although it is the case that three potential outliers are identified via the Malahanobis distance values, these values are not considered outliers to the trend that is found between the variables. There no values were removed for this analysis.  \r\n \r\nAnalysis\r\nFirst we calculate the mean vector containing Mass and Snout Length for each type.\r\n\r\n\r\n\r\nThey used large sample inference.\r\n\r\n\r\n#poolvar <- (nS -1)/(nS+nC -2)   * typeScov + (nC -1)/(nS+nC-2) * typeCcov \r\n#poolvar\r\n\r\n\r\n\r\nNow we create the simultainous confidence intervals\r\n\r\n\r\n\r\n\r\n\r\nTable 2: Confidence Intervals\r\n\r\n\r\nVariable\r\n\r\n\r\nLower\r\n\r\n\r\nUpper\r\n\r\n\r\nMass\r\n\r\n\r\n-0.55\r\n\r\n\r\n0.30\r\n\r\n\r\nSvl\r\n\r\n\r\n-0.03\r\n\r\n\r\n0.21\r\n\r\n\r\n\r\n#det of covariance matrix > 0 # did not include the correlation #need code for single mean comparison #need code for paired means comparison # sample size calculation\r\ncovmat <- cov(datafile[,3:5]) det(covmat)\r\ndo the regular t test interval for variable but use the bonferroni correction for p variables so alpha/p\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-12-16-lizards-cnemidophorus-vs-sceloporus/lizards-cnemidophorus-vs-sceloporus_files/figure-html5/unnamed-chunk-4-1.png",
    "last_modified": "2020-12-17T16:55:07-04:00",
    "input_file": "lizards-cnemidophorus-vs-sceloporus.utf8.md"
  },
  {
    "path": "posts/2020-12-16-numeric-representation-and-cognition/",
    "title": "Numeric Representation and Cognition",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Gavin Gordon",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2020-12-16",
    "categories": [],
    "contents": "\r\nProblem\r\nThe data was collected to test two psychological models of numerical cognition. Does the processing of numbers depend on the way the numbers are presented (words, Arabic digits)? Thirty-two subjects were required to make a series of quick numerical judgements about two numbers presented as either two number words (“two”,“four”) or two single Arabic digits (“2”,“4”). The subjects were asked to respond “same” if the two numbers had the same numerical parity (both were even or odd) and “different” if the two numbers had a different parity (one even, one odd). Half of the subjects were assigned a block of Arabic digit trials, followed by a block of number word trials, and half of the subjects received the blocks of trials in the reverse order. Within each block, the order of “same” and “different” parity trials was randomized for each subject. For each of the four combinations of parity format, the mean reaction times for correct responses were recorded for each subject.\r\nA test for the main effects of number type and parity as well as the interaction is performed using the one sample Hotelling T2.\r\nPreamble\r\nThis situation seemed kind of weird at first because you are testing the effects of one factor with a blocking variable on one dependent variable across time, so it should count as a repeated measures Anova. Which it is. Yet I found it in the Hotelling T2 section for multivariate techniques. In the calculation the problem is reduced to a hotelling T2 test so that I guess this is just one of the ways to handle the repeated measures; perhaps this is what is referred to as the Hotelling Trace test.\r\nSo I have an issue with the design. They decided to block on the number representation and to randomize on the parity. Which seems contrary to the question they would like to answer as the blocking factor is considered a nuisance to be removed and I recall some issue with it being used as an estimate for the factor effect. Then comes the question as to whether they can test for interaction. In a blocking design you would need replicates in order to do this. This design is not technically replicated as they changed the run order of the blocks for the second partition of the sample. I can understand applying the same design on different experimental units but are we allowed to make such a modification. I can understand why they did this, with reference to the NCSS manual for one way repeated measures; persons as they are exposed to the treatments can become better at the task across time or worse so it’s good to change the run order for some units to attempt to control for this issue.\r\nThis particular test does not use the information about the correlation between the measurements since these have a dependency within the units and thus has less power than a test that does account for the correlation. Perhaps we can explore the application of the other tests as well.\r\nAssumptions\r\nThe measurements within the experimental units are correlated while the measurements between the units are not.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2020-12-17T10:35:37-04:00",
    "input_file": "numeric-representation-and-cognition.utf8.md"
  }
]
